In [1]:
import numpy as np
import pandas as pd

# Read Data

In [2]:
students = pd.read_csv('Expanded_data_with_more_features.csv')
students

,Unnamed: 0,Gender,EthnicGroup,ParentEduc,LunchType,TestPrep,ParentMaritalStatus,PracticeSport,IsFirstChild,NrSiblings,TransportMeans,WklyStudyHours,MathScore,ReadingScore,WritingScore
0,0,female,NaN,bachelor's degree,standard,none,married,regularly,yes,3.0,school_bus,< 5,71,71,74
1,1,female,group C,some college,standard,NaN,married,sometimes,yes,0.0,NaN,5 - 10,69,90,88
2,2,female,group B,master's degree,standard,none,single,sometimes,yes,4.0,school_bus,< 5,87,93,91
3,3,male,group A,associate's degree,free/reduced,none,married,never,no,1.0,NaN,5 - 10,45,56,42
4,4,male,group C,some college,standard,none,married,sometimes,yes,0.0,school_bus,5 - 10,76,78,75
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
30636,816,female,group D,high school,standard,none,single,sometimes,no,2.0,school_bus,5 - 10,59,61,65
30637,890,male,group E,high school,standard,none,single,regularly,no,1.0,private,5 - 10,58,53,51
30638,911,female,NaN,high school,free/reduced,completed,married,sometimes,no,1.0,private,5 - 10,61,70,67
30639,934,female,group D,associate's degree,standard,completed,married,regularly,no,3.0,school_bus,5 - 10,82,90,93
30640,960,male,group B,some college,standard,none,married,never,no,1.0,school_bus,5 - 10,64,60,58

## Total size of Data

In [3]:
total_size = len(students)
total_size

30641

### Проаналізуйте розподіл за статтю серед учнів.
     1. Скільки студентів і студенток у наборі даних?
     2. Який відсоток студентів чоловічої статі в наборі даних?
     3. Який відсоток студенток у наборі даних?

In [4]:
male_num = len(students[ students['Gender'] == 'male'])
female_num = len(students[ students['Gender'] == 'female'])
print(f'Totasl : {total_size} student(s)')
print(f'Male   : {male_num} student(s) {(male_num/total_size*100.):.2f}%')
print(f'Female : {female_num} student(s) {(female_num/total_size*100.):.2f}%')

Totasl : 30641 student(s)
Male   : 15217 student(s) 49.66%
Female : 15424 student(s) 50.34%

### Дослідіть зв’язок між етнічною групою та результатами тестів.
     4. Яка етнічна група має найвищий середній бал з математики?
     5. Яка етнічна група має найвищий середній бал читання?
     6. Яка етнічна група має найвищий середній бал з письма?

In [16]:
list_of_groups = ['group A', 'group B', 'group C', 'group D', 'group E']
list_of_scores = ['MathScore', 'ReadingScore', 'WritingScore']

ROWS = []
for g in list_of_groups:
    grp_X = students[ students['EthnicGroup'] == g]

    dct = {}
    for s in list_of_scores:
        dct[s] = grp_X[s].mean()

    ROWS.append( dct )
    
df = pd.DataFrame(ROWS, index=list_of_groups)
df

         MathScore  ReadingScore  WritingScore
group A  62.991888     66.787742     65.251915
group B  63.490216     67.320460     65.895125
group C  64.695723     68.438233     66.999240
group D  67.666400     70.382247     70.890844
group E  75.298936     74.251423     72.677060

In [17]:
math_max = df['MathScore'].max()
print(math_max)
df[ df['MathScore'] == math_max ]

75.29893590695373

         MathScore  ReadingScore  WritingScore
group E  75.298936     74.251423      72.67706

In [18]:
reading_max = df['ReadingScore'].max()
print(reading_max)
df[ df['ReadingScore'] == reading_max ]

74.25142291512002

         MathScore  ReadingScore  WritingScore
group E  75.298936     74.251423      72.67706

In [19]:
writing_max = df['WritingScore'].max()
print(writing_max)
df[ df['WritingScore'] == writing_max ]

72.67706013363029

         MathScore  ReadingScore  WritingScore
group E  75.298936     74.251423      72.67706